src/InformationRegisters/НастройкиПодсистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодсистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подсистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиПодсистем/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидФормыДерево = Истина;
	ИзменитьОтображение();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтображение()
	
	Элементы.Список.Видимость = НЕ ВидФормыДерево;
	Элементы.НастройкиДерево.Видимость = ВидФормыДерево;
	Элементы.ФормаДобавить.Видимость = НЕ ВидФормыДерево;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидФормы(Команда)
	
	ВидФормыДерево = Не ВидФормыДерево;
	ИзменитьОтображение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройки(Команда)
	
	ЗаполнитьНастройкиНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьНастройкиНаСервере()
	
	Макет = РегистрыСведений.НастройкиПодсистем.ПолучитьМакет("ПервоначальныеНастройки");
	ОбластьНастройки = Макет.ПолучитьОбласть("Настройки");
	Для Индекс = 1 По ОбластьНастройки.ВысотаТаблицы Цикл
		Подсистема = ОбластьНастройки.Область(Индекс,1).Текст;
		Параметр = ОбластьНастройки.Область(Индекс,2).Текст;
		Значение = Вычислить(ОбластьНастройки.Область(Индекс,3).Текст);
		
		Запись = РегистрыСведений.НастройкиПодсистем.СоздатьМенеджерЗаписи();
		Запись.Подсистема = Подсистема;
		Запись.Параметр = Параметр;
		Запись.Значение = Значение;
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
